# Ultralytics YOLO 🚀, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
scales: 
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]


backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, HSG_WAVE_Block, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, HSG_WAVE_Block, [256, True]]
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16
  - [-1, 2, HSG_AKAT_Block, [384, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 7-P5/32
  - [-1, 1, HSG_AKAT_Block, [512, True]]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]  

  - [-1, 1, DySample,  [2, 'lp']] 
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]  
  - [[-2, -1], 1, Concat, [1]] 
  - [-1, 3, CPF_RepConv, [256, False, 2, 3]]  
  - [-1, 1, Conv, [128, 1, 1]]   

  - [-1, 1, DySample,  [2, 'lp']] 
  - [4, 1, Conv, [128, 1, 1, None, 1, 1, False]] 
  - [2, 1, AGDD, [128]]   
  - [[-3, -2, -1], 1, Concat, [1]] 
  - [-1, 1, MDFC, []]
  - [-1, 3, CPF_RepConv, [256, False, 2, 3]]    # 22

  - [-1, 1, Conv, [256, 3, 2]]   
  - [[-1, 16], 1, Concat, [1]] 
  - [-1, 3, CPF_RepConv, [256, False, 2, 3]]    # 25

  - [-1, 1, Conv, [256, 3, 2]]   
  - [[-1, 11], 1, Concat, [1]]  
  - [-1, 3, CPF_RepConv, [256, False, 2, 3]]    # 28

  - [[22, 25, 28], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)